const n=`# Markdown: सिंटैक्स

- [अवलोकन](#overview)
  - [दर्शन](#philosophy)
  - [इनलाइन HTML](#html)
  - [विशेष वर्णों के लिए स्वचालित एस्केपिंग](#autoescape)
- [ब्लॉक एलिमेंट्स](#block)
  - [पैराग्राफ़ और लाइन ब्रेक्स](#p)
  - [हेडर्स](#header)
  - [ब्लॉककोट्स](#blockquote)
  - [सूचियां](#list)
  - [कोड ब्लॉक्स](#precode)
  - [क्षैतिज नियम](#hr)
- [स्पैन एलिमेंट्स](#span)
  - [लिंक्स](#link)
  - [ज़ोर](#em)
  - [कोड](#code)
  - [छवियां](#img)
- [विविध](#misc)
  - [बैकस्लैश एस्केप्स](#backslash)
  - [स्वचालित लिंक्स](#autolink)

**नोट:** यह दस्तावेज़ स्वयं Markdown का उपयोग करके लिखा गया है; आप URL में '.text' जोड़कर [इसके लिए स्रोत देख सकते हैं][src]।

[src]: /projects/markdown/syntax.text

---

<h2 id="overview">अवलोकन</h2>

<h3 id="philosophy">दर्शन</h3>

Markdown का उद्देश्य यथासंभव पढ़ने और लिखने में आसान होना है।

हालांकि, पठनीयता, सब से ऊपर जोर दी गई है। Markdown-फ़ॉर्मेट किया गया दस्तावेज़ सादे टेक्स्ट के रूप में, बिना यह देखे कि इसे टैग या फ़ॉर्मेटिंग निर्देशों के साथ चिह्नित किया गया है, प्रकाशित करने योग्य होना चाहिए। जबकि Markdown का सिंटैक्स कई मौजूदा text-to-HTML फ़िल्टर से प्रभावित हुआ है -- जिनमें [Setext] [1], [atx] [2], [Textile] [3], [reStructuredText] [4], [Grutatext] [5], और [EtText] [6] शामिल हैं -- Markdown के सिंटैक्स के लिए प्रेरणा का सबसे बड़ा स्रोत प्लेन टेक्स्ट ईमेल का फ़ॉर्मेट है।

[1]: http://docutils.sourceforge.net/mirror/setext.html
[2]: http://www.aaronsw.com/2002/atx/
[3]: http://textism.com/tools/textile/
[4]: http://docutils.sourceforge.net/rst.html
[5]: http://www.triptico.com/software/grutatxt.html
[6]: http://ettext.taint.org/doc/

इस उद्देश्य के लिए, Markdown का सिंटैक्स पूरी तरह से विराम चिह्न वर्णों से बना है, जिन विराम चिह्न वर्णों को सावधानीपूर्वक चुना गया है ताकि वे जैसा दिखते हैं वैसा ही अर्थ रखें। उदा., किसी शब्द के चारों ओर तारांकन वास्तव में \\*ज़ोर\\* की तरह दिखते हैं। Markdown सूचियां, खैर, सूचियों की तरह दिखती हैं। यहां तक कि ब्लॉककोट्स भी उद्धृत टेक्स्ट के अंशों की तरह दिखते हैं, यह मानते हुए कि आपने कभी ईमेल का उपयोग किया है।

<h3 id="html">इनलाइन HTML</h3>

Markdown का सिंटैक्स एक उद्देश्य के लिए है: वेब के लिए _लिखने_ के लिए एक फ़ॉर्मेट के रूप में उपयोग किया जाए।

Markdown HTML के लिए एक प्रतिस्थापन नहीं है, या इसके करीब भी नहीं है। इसका सिंटैक्स बहुत छोटा है, जो HTML टैग के केवल एक बहुत छोटे सबसेट से मेल खाता है। विचार HTML टैग्स डालना आसान बनाने वाला सिंटैक्स बनाना _नहीं_ है। मेरी राय में, HTML टैग पहले से ही डालना आसान हैं। Markdown के लिए विचार गद्य को पढ़ना, लिखना और संपादित करना आसान बनाना है। HTML एक _प्रकाशन_ फ़ॉर्मेट है; Markdown एक _लेखन_ फ़ॉर्मेट है। इस प्रकार, Markdown का फ़ॉर्मेटिंग सिंटैक्स केवल उन मुद्दों को संबोधित करता है जिन्हें सादे टेक्स्ट में व्यक्त किया जा सकता है।

Markdown के सिंटैक्स द्वारा कवर नहीं किए गए किसी भी मार्कअप के लिए, आप बस HTML का ही उपयोग करते हैं। इसे पहले से बताने या सीमांकित करने की कोई आवश्यकता नहीं है कि आप Markdown से HTML पर स्विच कर रहे हैं; आप बस टैग का उपयोग करते हैं।

एकमात्र प्रतिबंध यह हैं कि ब्लॉक-स्तरीय HTML एलिमेंट्स -- उदा. \`<div>\`, \`<table>\`, \`<pre>\`, \`<p>\`, आदि -- आसपास की सामग्री से खाली लाइनों द्वारा अलग किए जाने चाहिए, और ब्लॉक के शुरुआती और अंतिम टैग टैब या स्पेस से इंडेंट नहीं होने चाहिए। Markdown इतना स्मार्ट है कि HTML ब्लॉक-स्तरीय टैग के आसपास अतिरिक्त (अवांछित) \`<p>\` टैग न जोड़े।

उदाहरण के लिए, Markdown लेख में एक HTML टेबल जोड़ने के लिए:

    यह एक नियमित पैराग्राफ़ है।

    <table>
        <tr>
            <td>Foo</td>
        </tr>
    </table>

    यह एक और नियमित पैराग्राफ़ है।

ध्यान दें कि ब्लॉक-स्तरीय HTML टैग के भीतर Markdown फ़ॉर्मेटिंग सिंटैक्स प्रोसेस नहीं किया जाता है। उदा., आप HTML ब्लॉक के अंदर Markdown-शैली \`*emphasis*\` का उपयोग नहीं कर सकते।

स्पैन-स्तरीय HTML टैग -- उदा. \`<span>\`, \`<cite>\`, या \`<del>\` -- Markdown पैराग्राफ़, सूची आइटम या हेडर में कहीं भी उपयोग किए जा सकते हैं। यदि आप चाहें, तो आप Markdown फ़ॉर्मेटिंग के बजाय HTML टैग भी उपयोग कर सकते हैं; उदा. यदि आप Markdown के लिंक या इमेज सिंटैक्स के बजाय HTML \`<a>\` या \`<img>\` टैग का उपयोग करना पसंद करते हैं, तो आगे बढ़ें।

ब्लॉक-स्तरीय HTML टैग के विपरीत, Markdown सिंटैक्स स्पैन-स्तरीय टैग के भीतर _प्रोसेस_ किया जाता है।

<h3 id="autoescape">विशेष वर्णों के लिए स्वचालित एस्केपिंग</h3>

HTML में, दो वर्ण हैं जो विशेष उपचार की मांग करते हैं: \`<\` और \`&\`। बाईं कोण ब्रैकेट का उपयोग टैग शुरू करने के लिए किया जाता है; ampersands का उपयोग HTML एंटिटीज को दर्शाने के लिए किया जाता है। यदि आप उन्हें शाब्दिक वर्णों के रूप में उपयोग करना चाहते हैं, तो आपको उन्हें एंटिटीज के रूप में एस्केप करना होगा, उदा. \`&lt;\`, और \`&amp;\`।

विशेष रूप से Ampersands वेब लेखकों के लिए परेशानी का सबब हैं। यदि आप 'AT&T' के बारे में लिखना चाहते हैं, तो आपको '\`AT&amp;T\`' लिखना होगा। आपको URLs के भीतर भी ampersands को एस्केप करने की आवश्यकता है। इस प्रकार, यदि आप लिंक करना चाहते हैं:

    http://images.google.com/images?num=30&q=larry+bird

आपको URL को इस प्रकार एनकोड करने की आवश्यकता है:

    http://images.google.com/images?num=30&amp;q=larry+bird

अपने एंकर टैग \`href\` एट्रिब्यूट में। कहने की ज़रूरत नहीं है, यह भूलना आसान है, और शायद अन्यथा अच्छी तरह से मार्क अप की गई वेब साइटों में HTML सत्यापन त्रुटियों का एकल सबसे आम स्रोत है।

Markdown आपको इन वर्णों को स्वाभाविक रूप से उपयोग करने की अनुमति देता है, आपके लिए सभी आवश्यक एस्केपिंग की देखभाल करता है। यदि आप HTML एंटिटी के हिस्से के रूप में ampersand का उपयोग करते हैं, तो यह अपरिवर्तित रहता है; अन्यथा इसे \`&amp;\` में अनुवादित किया जाएगा।

तो, यदि आप अपने लेख में कॉपीराइट प्रतीक शामिल करना चाहते हैं, तो आप लिख सकते हैं:

    &copy;

और Markdown इसे अकेला छोड़ देगा। लेकिन यदि आप लिखते हैं:

    AT&T

Markdown इसे अनुवादित करेगा:

    AT&amp;T

इसी तरह, क्योंकि Markdown [इनलाइन HTML](#html) का समर्थन करता है, यदि आप HTML टैग के लिए सीमांकक के रूप में कोण ब्रैकेट का उपयोग करते हैं, तो Markdown उन्हें वैसे ही मानेगा। लेकिन यदि आप लिखते हैं:

    4 < 5

Markdown इसे अनुवादित करेगा:

    4 &lt; 5

हालांकि, Markdown कोड स्पैन और ब्लॉक्स के अंदर, कोण ब्रैकेट और ampersands _हमेशा_ स्वचालित रूप से एनकोड किए जाते हैं। यह HTML कोड के बारे में लिखने के लिए Markdown का उपयोग करना आसान बनाता है। (raw HTML के विपरीत, जो HTML सिंटैक्स के बारे में लिखने के लिए एक भयानक फ़ॉर्मेट है, क्योंकि आपके उदाहरण कोड में प्रत्येक एकल \`<\` और \`&\` को एस्केप करने की आवश्यकता है।)

---

<h2 id="block">ब्लॉक एलिमेंट्स</h2>

<h3 id="p">पैराग्राफ़ और लाइन ब्रेक्स</h3>

एक पैराग्राफ़ बस टेक्स्ट की एक या अधिक लगातार लाइनें हैं, जो एक या अधिक खाली लाइनों द्वारा अलग की गई हैं। (एक खाली लाइन कोई भी लाइन है जो खाली लाइन की तरह दिखती है -- केवल स्पेस या टैब वाली लाइन को खाली माना जाता है।) सामान्य पैराग्राफ़ स्पेस या टैब से इंडेंट नहीं होने चाहिए।

"टेक्स्ट की एक या अधिक लगातार लाइनें" नियम का निहितार्थ यह है कि Markdown "हार्ड-रैप्ड" टेक्स्ट पैराग्राफ़ का समर्थन करता है। यह अधिकांश अन्य text-to-HTML फ़ॉर्मेटर्स से काफी अलग है (जिसमें Movable Type का "Convert Line Breaks" विकल्प शामिल है) जो पैराग्राफ़ में प्रत्येक लाइन ब्रेक वर्ण को \`<br />\` टैग में अनुवादित करते हैं।

जब आप Markdown का उपयोग करके \`<br />\` ब्रेक टैग डालना _चाहते_ हैं, तो आप दो या अधिक स्पेस के साथ एक लाइन समाप्त करते हैं, फिर रिटर्न टाइप करते हैं।

हां, \`<br />\` बनाने के लिए इसमें थोड़ा अधिक प्रयास लगता है, लेकिन एक सरल "हर लाइन ब्रेक एक \`<br />\` है" नियम Markdown के लिए काम नहीं करेगा। Markdown का ईमेल-शैली [blockquoting][bq] और बहु-पैराग्राफ़ [सूची आइटम][l] सबसे अच्छा काम करते हैं -- और बेहतर दिखते हैं -- जब आप उन्हें हार्ड ब्रेक के साथ फ़ॉर्मेट करते हैं।

[bq]: #blockquote
[l]: #list

<h3 id="header">हेडर्स</h3>

Markdown दो शैलियों के हेडर्स का समर्थन करता है, [Setext] [1] और [atx] [2]।

Setext-शैली के हेडर्स को समान चिह्नों (प्रथम-स्तर के हेडर्स के लिए) और डैश (द्वितीय-स्तर के हेडर्स के लिए) का उपयोग करके "अंडरलाइन" किया जाता है। उदाहरण के लिए:

    यह एक H1 है
    =============

    यह एक H2 है
    -------------

अंडरलाइनिंग \`=\`'s या \`-\`'s की कोई भी संख्या काम करेगी।

Atx-शैली के हेडर्स लाइन की शुरुआत में 1-6 हैश वर्णों का उपयोग करते हैं, जो हेडर स्तर 1-6 के अनुरूप होते हैं। उदाहरण के लिए:

    # यह एक H1 है

    ## यह एक H2 है

    ###### यह एक H6 है

वैकल्पिक रूप से, आप atx-शैली के हेडर्स को "बंद" कर सकते हैं। यह विशुद्ध रूप से कॉस्मेटिक है -- यदि आपको लगता है कि यह बेहतर दिखता है तो आप इसका उपयोग कर सकते हैं। बंद करने वाले हैश को हेडर खोलने के लिए उपयोग किए गए हैश की संख्या से मेल खाने की भी आवश्यकता नहीं है। (खोलने वाले हैश की संख्या हेडर स्तर निर्धारित करती है।) :

    # यह एक H1 है #

    ## यह एक H2 है ##

    ### यह एक H3 है ######

<h3 id="blockquote">ब्लॉककोट्स</h3>

Markdown blockquoting के लिए ईमेल-शैली \`>\` वर्णों का उपयोग करता है। यदि आप ईमेल संदेश में टेक्स्ट के अंशों को उद्धृत करने से परिचित हैं, तो आप जानते हैं कि Markdown में blockquote कैसे बनाया जाता है। यदि आप टेक्स्ट को हार्ड रैप करते हैं और हर लाइन से पहले \`>\` रखते हैं तो यह सबसे अच्छा दिखता है:

    > यह दो पैराग्राफ़ वाला एक ब्लॉककोट है। Lorem ipsum dolor sit amet,
    > consectetuer adipiscing elit. Aliquam hendrerit mi posuere lectus.
    > Vestibulum enim wisi, viverra nec, fringilla in, laoreet vitae, risus.
    >
    > Donec sit amet nisl. Aliquam semper ipsum sit amet velit. Suspendisse
    > id sem consectetuer libero luctus adipiscing.

Markdown आपको आलसी होने और केवल हार्ड-रैप्ड पैराग्राफ़ की पहली लाइन से पहले \`>\` रखने की अनुमति देता है:

    > यह दो पैराग्राफ़ वाला एक ब्लॉककोट है। Lorem ipsum dolor sit amet,
    consectetuer adipiscing elit. Aliquam hendrerit mi posuere lectus.
    Vestibulum enim wisi, viverra nec, fringilla in, laoreet vitae, risus.

    > Donec sit amet nisl. Aliquam semper ipsum sit amet velit. Suspendisse
    id sem consectetuer libero luctus adipiscing.

Blockquotes को नेस्ट किया जा सकता है (यानी एक blockquote-in-a-blockquote) \`>\` के अतिरिक्त स्तर जोड़कर:

    > यह उद्धरण का पहला स्तर है।
    >
    > > यह नेस्टेड ब्लॉककोट है।
    >
    > पहले स्तर पर वापस।

Blockquotes में अन्य Markdown एलिमेंट्स शामिल हो सकते हैं, जिनमें हेडर्स, सूचियां और कोड ब्लॉक्स शामिल हैं:

    > ## यह एक हेडर है।
    >
    > 1.   यह पहली सूची आइटम है।
    > 2.   यह दूसरी सूची आइटम है।
    >
    > यहां कुछ उदाहरण कोड है:
    >
    >     return shell_exec("echo $input | $markdown_script");

कोई भी अच्छा टेक्स्ट एडिटर ईमेल-शैली quoting को आसान बनाना चाहिए। उदाहरण के लिए, BBEdit के साथ, आप एक चयन कर सकते हैं और Text मेनू से Increase Quote Level चुन सकते हैं।

<h3 id="list">सूचियां</h3>

Markdown क्रमबद्ध (नंबर वाली) और अक्रमबद्ध (बुलेटेड) सूचियों का समर्थन करता है।

अक्रमबद्ध सूचियां तारांकन, प्लस और हाइफ़न का उपयोग करती हैं -- परस्पर विनिमेय रूप से -- सूची मार्करों के रूप में:

    *   लाल
    *   हरा
    *   नीला

बराबर है:

    +   लाल
    +   हरा
    +   नीला

और:

    -   लाल
    -   हरा
    -   नीला

क्रमबद्ध सूचियां संख्याओं के बाद पीरियड का उपयोग करती हैं:

    1.  Bird
    2.  McHale
    3.  Parish

यह ध्यान रखना महत्वपूर्ण है कि सूची को चिह्नित करने के लिए आप जो वास्तविक संख्याओं का उपयोग करते हैं, उनका Markdown द्वारा उत्पादित HTML आउटपुट पर कोई प्रभाव नहीं पड़ता है। उपरोक्त सूची से Markdown जो HTML उत्पन्न करता है वह है:

    <ol>
    <li>Bird</li>
    <li>McHale</li>
    <li>Parish</li>
    </ol>

यदि आपने इसके बजाय Markdown में इस तरह सूची लिखी:

    1.  Bird
    1.  McHale
    1.  Parish

या यहां तक कि:

    3. Bird
    1. McHale
    8. Parish

आपको बिल्कुल वही HTML आउटपुट मिलेगा। बात यह है कि, यदि आप चाहें, तो आप अपनी क्रमबद्ध Markdown सूचियों में क्रमिक संख्याओं का उपयोग कर सकते हैं, ताकि आपके स्रोत में संख्याएं आपके प्रकाशित HTML में संख्याओं से मेल खाएं। लेकिन यदि आप आलसी होना चाहते हैं, तो आपको ऐसा करने की आवश्यकता नहीं है।

यदि आप आलसी सूची नंबरिंग का उपयोग करते हैं, हालांकि, आपको अभी भी संख्या 1 से सूची शुरू करनी चाहिए। भविष्य में किसी समय, Markdown मनमाने संख्या से क्रमबद्ध सूचियां शुरू करने का समर्थन कर सकता है।

सूची मार्कर आमतौर पर बाएं मार्जिन पर शुरू होते हैं, लेकिन तीन स्पेस तक इंडेंट किए जा सकते हैं। सूची मार्करों के बाद एक या अधिक स्पेस या टैब होना चाहिए।

सूचियों को अच्छा दिखाने के लिए, आप hanging indents के साथ आइटम रैप कर सकते हैं:

    *   Lorem ipsum dolor sit amet, consectetuer adipiscing elit.
        Aliquam hendrerit mi posuere lectus. Vestibulum enim wisi,
        viverra nec, fringilla in, laoreet vitae, risus.
    *   Donec sit amet nisl. Aliquam semper ipsum sit amet velit.
        Suspendisse id sem consectetuer libero luctus adipiscing.

लेकिन यदि आप आलसी होना चाहते हैं, तो आपको ऐसा करने की आवश्यकता नहीं है:

    *   Lorem ipsum dolor sit amet, consectetuer adipiscing elit.
    Aliquam hendrerit mi posuere lectus. Vestibulum enim wisi,
    viverra nec, fringilla in, laoreet vitae, risus.
    *   Donec sit amet nisl. Aliquam semper ipsum sit amet velit.
    Suspendisse id sem consectetuer libero luctus adipiscing.

यदि सूची आइटम खाली लाइनों द्वारा अलग किए गए हैं, तो Markdown HTML आउटपुट में आइटम को \`<p>\` टैग में रैप करेगा। उदाहरण के लिए, यह इनपुट:

    *   पक्षी
    *   जादू

में बदल जाएगा:

    <ul>
    <li>पक्षी</li>
    <li>जादू</li>
    </ul>

लेकिन यह:

    *   पक्षी

    *   जादू

में बदल जाएगा:

    <ul>
    <li><p>पक्षी</p></li>
    <li><p>जादू</p></li>
    </ul>

सूची आइटम में कई पैराग्राफ़ हो सकते हैं। सूची आइटम में प्रत्येक बाद के पैराग्राफ़ को 4 स्पेस या एक टैब द्वारा इंडेंट किया जाना चाहिए:

    1.  यह दो पैराग्राफ़ वाली एक सूची आइटम है। Lorem ipsum dolor
        sit amet, consectetuer adipiscing elit. Aliquam hendrerit
        mi posuere lectus.

        Vestibulum enim wisi, viverra nec, fringilla in, laoreet
        vitae, risus. Donec sit amet nisl. Aliquam semper ipsum
        sit amet velit.

    2.  Suspendisse id sem consectetuer libero luctus adipiscing.

यह अच्छा दिखता है यदि आप बाद के पैराग्राफ़ की प्रत्येक लाइन को इंडेंट करते हैं, लेकिन यहां फिर से, Markdown आपको आलसी होने की अनुमति देगा:

    *   यह दो पैराग्राफ़ वाली एक सूची आइटम है।

        यह सूची आइटम में दूसरा पैराग्राफ़ है। आपको
    केवल पहली लाइन को इंडेंट करना आवश्यक है। Lorem ipsum dolor
    sit amet, consectetuer adipiscing elit.

    *   इसी सूची में एक और आइटम।

सूची आइटम के भीतर blockquote रखने के लिए, blockquote के \`>\` सीमांककों को इंडेंट करने की आवश्यकता है:

    *   ब्लॉककोट के साथ एक सूची आइटम:

        > यह एक ब्लॉककोट है
        > सूची आइटम के अंदर।

सूची आइटम के भीतर कोड ब्लॉक रखने के लिए, कोड ब्लॉक को _दो बार_ इंडेंट करने की आवश्यकता है -- 8 स्पेस या दो टैब:

    *   कोड ब्लॉक के साथ एक सूची आइटम:

            <यहां कोड आता है>

यह ध्यान देने योग्य है कि दुर्घटना से क्रमबद्ध सूची ट्रिगर करना संभव है, इस तरह कुछ लिखकर:

    1986. क्या शानदार सीज़न था।

दूसरे शब्दों में, लाइन की शुरुआत में एक _number-period-space_ अनुक्रम। इससे बचने के लिए, आप पीरियड को बैकस्लैश-एस्केप कर सकते हैं:

    1986\\. क्या शानदार सीज़न था।

<h3 id="precode">कोड ब्लॉक्स</h3>

पूर्व-फ़ॉर्मेट किए गए कोड ब्लॉक्स का उपयोग प्रोग्रामिंग या मार्कअप स्रोत कोड के बारे में लिखने के लिए किया जाता है। सामान्य पैराग्राफ़ बनाने के बजाय, कोड ब्लॉक की लाइनों को शाब्दिक रूप से व्याख्या किया जाता है। Markdown एक कोड ब्लॉक को \`<pre>\` और \`<code>\` टैग दोनों में रैप करता है।

Markdown में कोड ब्लॉक उत्पन्न करने के लिए, बस ब्लॉक की प्रत्येक लाइन को कम से कम 4 स्पेस या 1 टैब से इंडेंट करें। उदाहरण के लिए, यह इनपुट दिया गया:

    यह एक नियमित पैराग्राफ़ है:

        यह एक कोड ब्लॉक है।

Markdown उत्पन्न करेगा:

    <p>यह एक नियमित पैराग्राफ़ है:</p>

    <pre><code>यह एक कोड ब्लॉक है।
    </code></pre>

इंडेंटेशन का एक स्तर -- 4 स्पेस या 1 टैब -- कोड ब्लॉक की प्रत्येक लाइन से हटा दिया जाता है। उदाहरण के लिए, यह:

    यहां AppleScript का एक उदाहरण है:

        tell application "Foo"
            beep
        end tell

में बदल जाएगा:

    <p>यहां AppleScript का एक उदाहरण है:</p>

    <pre><code>tell application "Foo"
        beep
    end tell
    </code></pre>

एक कोड ब्लॉक तब तक जारी रहता है जब तक कि यह एक लाइन तक नहीं पहुंच जाता जो इंडेंट नहीं है (या लेख के अंत तक)।

कोड ब्लॉक के भीतर, ampersands (\`&\`) और कोण ब्रैकेट (\`<\` और \`>\`) स्वचालित रूप से HTML एंटिटीज में परिवर्तित हो जाते हैं। यह Markdown का उपयोग करके उदाहरण HTML स्रोत कोड शामिल करना बहुत आसान बनाता है -- बस इसे पेस्ट करें और इंडेंट करें, और Markdown ampersands और कोण ब्रैकेट को एनकोड करने की परेशानी संभालेगा। उदाहरण के लिए, यह:

        <div class="footer">
            &copy; 2004 Foo Corporation
        </div>

में बदल जाएगा:

    <pre><code>&lt;div class="footer"&gt;
        &amp;copy; 2004 Foo Corporation
    &lt;/div&gt;
    </code></pre>

नियमित Markdown सिंटैक्स कोड ब्लॉक्स के भीतर प्रोसेस नहीं किया जाता है। उदा., तारांकन कोड ब्लॉक के भीतर केवल शाब्दिक तारांकन हैं। इसका मतलब है कि Markdown का अपने स्वयं के सिंटैक्स के बारे में लिखने के लिए Markdown का उपयोग करना भी आसान है।

<h3 id="hr">क्षैतिज नियम</h3>

आप क्षैतिज नियम टैग (\`<hr />\`) उत्पन्न कर सकते हैं एक लाइन पर अपने आप तीन या अधिक हाइफ़न, तारांकन या अंडरस्कोर रखकर। यदि आप चाहें, तो आप हाइफ़न या तारांकन के बीच स्पेस का उपयोग कर सकते हैं। निम्नलिखित प्रत्येक लाइन एक क्षैतिज नियम उत्पन्न करेगी:

    * * *

    ***

    *****

    - - -

    ---------------------------------------

---

<h2 id="span">स्पैन एलिमेंट्स</h2>

<h3 id="link">लिंक्स</h3>

Markdown दो शैली के लिंक्स का समर्थन करता है: _इनलाइन_ और _संदर्भ_।

दोनों शैलियों में, लिंक टेक्स्ट [वर्ग ब्रैकेट] द्वारा सीमांकित है।

इनलाइन लिंक बनाने के लिए, लिंक टेक्स्ट के बंद होने वाले वर्ग ब्रैकेट के तुरंत बाद नियमित कोष्ठकों के एक सेट का उपयोग करें। कोष्ठकों के अंदर, वह URL रखें जहां आप लिंक को इंगित करना चाहते हैं, उद्धरण में घिरे लिंक के लिए एक _वैकल्पिक_ शीर्षक के साथ। उदाहरण के लिए:

    यह [एक उदाहरण](http://example.com/ "शीर्षक") इनलाइन लिंक है।

    [इस लिंक](http://example.net/) में कोई शीर्षक एट्रिब्यूट नहीं है।

उत्पन्न करेगा:

    <p>यह <a href="http://example.com/" title="शीर्षक">
    एक उदाहरण</a> इनलाइन लिंक है।</p>

    <p><a href="http://example.net/">इस लिंक</a> में कोई
    शीर्षक एट्रिब्यूट नहीं है।</p>

यदि आप उसी सर्वर पर स्थानीय संसाधन का संदर्भ दे रहे हैं, तो आप सापेक्ष पथ का उपयोग कर सकते हैं:

    विवरण के लिए मेरा [परिचय](/about/) पृष्ठ देखें।

संदर्भ-शैली लिंक वर्ग ब्रैकेट के दूसरे सेट का उपयोग करते हैं, जिनके अंदर आप लिंक की पहचान करने के लिए अपनी पसंद का लेबल रखते हैं:

    यह [एक उदाहरण][id] संदर्भ-शैली लिंक है।

आप वैकल्पिक रूप से ब्रैकेट के सेटों को अलग करने के लिए एक स्पेस का उपयोग कर सकते हैं:

    यह [एक उदाहरण] [id] संदर्भ-शैली लिंक है।

फिर, दस्तावेज़ में कहीं भी, आप अपने लिंक लेबल को इस तरह परिभाषित करते हैं, अपने आप एक लाइन पर:

    [id]: http://example.com/  "वैकल्पिक शीर्षक यहां"

यानी:

- लिंक पहचानकर्ता वाले वर्ग ब्रैकेट (वैकल्पिक रूप से बाएं मार्जिन से तीन स्पेस तक इंडेंट);
- उसके बाद एक कोलन;
- उसके बाद एक या अधिक स्पेस (या टैब);
- उसके बाद लिंक के लिए URL;
- वैकल्पिक रूप से लिंक के लिए शीर्षक एट्रिब्यूट, दोहरे या एकल उद्धरण में, या कोष्ठकों में।

निम्नलिखित तीन लिंक परिभाषाएं समतुल्य हैं:

    [foo]: http://example.com/  "वैकल्पिक शीर्षक यहां"
    [foo]: http://example.com/  'वैकल्पिक शीर्षक यहां'
    [foo]: http://example.com/  (वैकल्पिक शीर्षक यहां)

**नोट:** Markdown.pl 1.0.1 में एक ज्ञात बग है जो एकल उद्धरणों को लिंक शीर्षकों को सीमांकित करने से रोकता है।

लिंक URL, वैकल्पिक रूप से, कोण ब्रैकेट से घिरा हो सकता है:

    [id]: <http://example.com/>  "वैकल्पिक शीर्षक यहां"

आप शीर्षक एट्रिब्यूट को अगली लाइन पर रख सकते हैं और padding के लिए अतिरिक्त स्पेस या टैब का उपयोग कर सकते हैं, जो लंबे URLs के साथ बेहतर दिखता है:

    [id]: http://example.com/longish/path/to/resource/here
        "वैकल्पिक शीर्षक यहां"

लिंक परिभाषाओं का उपयोग केवल Markdown प्रोसेसिंग के दौरान लिंक बनाने के लिए किया जाता है, और HTML आउटपुट में आपके दस्तावेज़ से हटाया जाता है।

लिंक परिभाषा नाम अक्षरों, संख्याओं, स्पेस और विराम चिह्नों से मिलकर बन सकते हैं -- लेकिन वे case sensitive _नहीं_ हैं। उदा. ये दो लिंक:

    [link text][a]
    [link text][A]

समतुल्य हैं।

_implicit link name_ शॉर्टकट आपको लिंक के नाम को छोड़ने की अनुमति देता है, इस स्थिति में लिंक टेक्स्ट स्वयं नाम के रूप में उपयोग किया जाता है। बस वर्ग ब्रैकेट के एक खाली सेट का उपयोग करें -- उदा., शब्द "Google" को google.com वेब साइट से लिंक करने के लिए, आप बस लिख सकते हैं:

    [Google][]

और फिर लिंक परिभाषित करें:

    [Google]: http://google.com/

क्योंकि लिंक नाम में स्पेस हो सकते हैं, यह शॉर्टकट लिंक टेक्स्ट में एकाधिक शब्दों के लिए भी काम करता है:

    अधिक जानकारी के लिए [Daring Fireball][] पर जाएं।

और फिर लिंक परिभाषित करें:

    [Daring Fireball]: http://daringfireball.net/

लिंक परिभाषाओं को आपके Markdown दस्तावेज़ में कहीं भी रखा जा सकता है। मैं उन्हें प्रत्येक पैराग्राफ़ के तुरंत बाद रखता हूं जिसमें उनका उपयोग किया जाता है, लेकिन यदि आप चाहें, तो आप उन सभी को अपने दस्तावेज़ के अंत में रख सकते हैं, फ़ुटनोट्स की तरह।

यहां संदर्भ लिंक का एक उदाहरण कार्रवाई में है:

    मुझे [Google] [1] से [Yahoo] [2] या [MSN] [3]
    की तुलना में 10 गुना अधिक ट्रैफ़िक मिलता है।

      [1]: http://google.com/        "Google"
      [2]: http://search.yahoo.com/  "Yahoo खोज"
      [3]: http://search.msn.com/    "MSN खोज"

implicit link name शॉर्टकट का उपयोग करके, आप इसके बजाय लिख सकते हैं:

    मुझे [Google][] से [Yahoo][] या [MSN][]
    की तुलना में 10 गुना अधिक ट्रैफ़िक मिलता है।

      [google]: http://google.com/        "Google"
      [yahoo]:  http://search.yahoo.com/  "Yahoo खोज"
      [msn]:    http://search.msn.com/    "MSN खोज"

उपरोक्त दोनों उदाहरण निम्नलिखित HTML आउटपुट उत्पन्न करेंगे:

    <p>मुझे <a href="http://google.com/"
    title="Google">Google</a> से <a href="http://search.yahoo.com/" title="Yahoo खोज">Yahoo</a>
    या <a href="http://search.msn.com/" title="MSN खोज">MSN</a> की तुलना में 10 गुना अधिक ट्रैफ़िक मिलता है।</p>

तुलना के लिए, यहां Markdown की इनलाइन लिंक शैली का उपयोग करके लिखा गया वही पैराग्राफ़ है:

    मुझे [Google](http://google.com/ "Google") से [Yahoo](http://search.yahoo.com/ "Yahoo खोज") या
    [MSN](http://search.msn.com/ "MSN खोज") की तुलना में 10 गुना अधिक ट्रैफ़िक मिलता है।

संदर्भ-शैली लिंक का बिंदु यह नहीं है कि उन्हें लिखना आसान है। बिंदु यह है कि संदर्भ-शैली लिंक के साथ, आपका दस्तावेज़ स्रोत बहुत अधिक पठनीय है। उपरोक्त उदाहरणों की तुलना करें: संदर्भ-शैली लिंक का उपयोग करते हुए, पैराग्राफ़ स्वयं केवल 81 वर्ण लंबा है; इनलाइन-शैली लिंक के साथ, यह 176 वर्ण है; और raw HTML के रूप में, यह 234 वर्ण है। raw HTML में, टेक्स्ट की तुलना में अधिक मार्कअप है।

Markdown के संदर्भ-शैली लिंक के साथ, एक स्रोत दस्तावेज़ अंतिम आउटपुट से बहुत अधिक मिलता-जुलता है, जैसा कि ब्राउज़र में रेंडर किया गया है। मार्कअप-संबंधित मेटाडेटा को पैराग्राफ़ से बाहर ले जाने की अनुमति देकर, आप अपने गद्य के कथा प्रवाह को बाधित किए बिना लिंक जोड़ सकते हैं।

<h3 id="em">ज़ोर</h3>

Markdown तारांकन (\`*\`) और अंडरस्कोर (\`_\`) को ज़ोर के संकेतकों के रूप में मानता है। एक \`*\` या \`_\` से रैप किया गया टेक्स्ट HTML \`<em>\` टैग के साथ रैप किया जाएगा; दोहरे \`*\`'s या \`_\`'s को HTML \`<strong>\` टैग के साथ रैप किया जाएगा। उदा., यह इनपुट:

    *एकल तारांकन*

    _एकल अंडरस्कोर_

    **दोहरे तारांकन**

    __दोहरे अंडरस्कोर__

उत्पन्न करेगा:

    <em>एकल तारांकन</em>

    <em>एकल अंडरस्कोर</em>

    <strong>दोहरे तारांकन</strong>

    <strong>दोहरे अंडरस्कोर</strong>

आप जो भी शैली पसंद करते हैं उसका उपयोग कर सकते हैं; एकमात्र प्रतिबंध यह है कि ज़ोर स्पैन को खोलने और बंद करने के लिए एक ही वर्ण का उपयोग किया जाना चाहिए।

ज़ोर का उपयोग शब्द के बीच में किया जा सकता है:

    un*frigging*believable

लेकिन यदि आप \`*\` या \`_\` को स्पेस से घेरते हैं, तो इसे शाब्दिक तारांकन या अंडरस्कोर के रूप में माना जाएगा।

एक शाब्दिक तारांकन या अंडरस्कोर को ऐसी स्थिति में उत्पन्न करने के लिए जहां इसे अन्यथा ज़ोर सीमांकक के रूप में उपयोग किया जाएगा, आप इसे बैकस्लैश से एस्केप कर सकते हैं:

    \\*यह टेक्स्ट शाब्दिक तारांकनों से घिरा है\\*

<h3 id="code">कोड</h3>

कोड के स्पैन को इंगित करने के लिए, इसे बैकटिक उद्धरण (\`\` \` \`\`) से रैप करें। पूर्व-फ़ॉर्मेट किए गए कोड ब्लॉक के विपरीत, कोड स्पैन सामान्य पैराग्राफ़ के भीतर कोड को इंगित करता है। उदाहरण के लिए:

    Use the \`printf()\` function.

उत्पन्न करेगा:

    <p>Use the <code>printf()</code> function.</p>

कोड स्पैन के भीतर एक शाब्दिक बैकटिक वर्ण शामिल करने के लिए, आप खोलने और बंद करने वाले सीमांकक के रूप में एकाधिक बैकटिक का उपयोग कर सकते हैं:

    \`\`यहां एक शाब्दिक बैकटिक (\`) है।\`\`

जो यह उत्पन्न करेगा:

    <p><code>यहां एक शाब्दिक बैकटिक (\`) है।</code></p>

कोड स्पैन को घेरने वाले बैकटिक सीमांककों में स्पेस शामिल हो सकते हैं -- खोलने के बाद एक, बंद करने से पहले एक। यह आपको कोड स्पैन की शुरुआत या अंत में शाब्दिक बैकटिक वर्ण रखने की अनुमति देता है:

    कोड स्पैन में एक एकल बैकटिक: \`\` \` \`\`

    कोड स्पैन में बैकटिक-सीमांकित स्ट्रिंग: \`\` \`foo\` \`\`

उत्पन्न करेगा:

    <p>कोड स्पैन में एक एकल बैकटिक: <code>\`</code></p>

    <p>कोड स्पैन में बैकटिक-सीमांकित स्ट्रिंग: <code>\`foo\`</code></p>

कोड स्पैन के साथ, ampersands और कोण ब्रैकेट स्वचालित रूप से HTML एंटिटीज के रूप में एनकोड किए जाते हैं, जो उदाहरण HTML टैग शामिल करना आसान बनाता है। Markdown इसे बदल देगा:

    Please don't use any \`<blink>\` tags.

में:

    <p>Please don't use any <code>&lt;blink&gt;</code> tags.</p>

आप इसे लिख सकते हैं:

    \`&#8212;\` is the decimal-encoded equivalent of \`&mdash;\`.

उत्पन्न करने के लिए:

    <p><code>&amp;#8212;</code> is the decimal-encoded
    equivalent of <code>&amp;mdash;</code>.</p>

<h3 id="img">छवियां</h3>

स्वीकार्य रूप से, प्लेन टेक्स्ट दस्तावेज़ फ़ॉर्मेट में छवियों को रखने के लिए एक "स्वाभाविक" सिंटैक्स तैयार करना काफी मुश्किल है।

Markdown एक इमेज सिंटैक्स का उपयोग करता है जो लिंक के लिए सिंटैक्स से मिलता-जुलता है, दो शैलियों की अनुमति देता है: _इनलाइन_ और _संदर्भ_।

इनलाइन इमेज सिंटैक्स इस तरह दिखता है:

    ![वैकल्पिक टेक्स्ट](/path/to/img.jpg)

    ![वैकल्पिक टेक्स्ट](/path/to/img.jpg "वैकल्पिक शीर्षक")

यानी:

- एक विस्मयादिबोधक चिह्न: \`!\`;
- उसके बाद वर्ग ब्रैकेट का एक सेट, जिसमें इमेज के लिए \`alt\` एट्रिब्यूट टेक्स्ट है;
- उसके बाद कोष्ठकों का एक सेट, जिसमें URL या इमेज का पथ है, और दोहरे या एकल उद्धरणों में एक वैकल्पिक \`title\` एट्रिब्यूट है।

संदर्भ-शैली इमेज सिंटैक्स इस तरह दिखता है:

    ![वैकल्पिक टेक्स्ट][id]

जहां "id" एक परिभाषित इमेज संदर्भ का नाम है। इमेज संदर्भों को लिंक संदर्भों के समान सिंटैक्स का उपयोग करके परिभाषित किया जाता है:

    [id]: url/to/image  "वैकल्पिक शीर्षक एट्रिब्यूट"

इस लेखन के अनुसार, Markdown के पास इमेज के आयामों को निर्दिष्ट करने के लिए कोई सिंटैक्स नहीं है; यदि यह आपके लिए महत्वपूर्ण है, तो आप बस नियमित HTML \`<img>\` टैग का उपयोग कर सकते हैं।

---

<h2 id="misc">विविध</h2>

<h3 id="autolink">स्वचालित लिंक्स</h3>

Markdown URLs और ईमेल पतों के लिए "स्वचालित" लिंक बनाने के लिए एक शॉर्टकट शैली का समर्थन करता है: बस URL या ईमेल पते को कोण ब्रैकेट से घेरें। इसका मतलब यह है कि यदि आप URL या ईमेल पते का वास्तविक टेक्स्ट दिखाना चाहते हैं, और यह भी चाहते हैं कि यह एक क्लिक करने योग्य लिंक हो, तो आप यह कर सकते हैं:

    <http://example.com/>

Markdown इसे बदल देगा:

    <a href="http://example.com/">http://example.com/</a>

ईमेल पतों के लिए स्वचालित लिंक समान रूप से काम करते हैं, सिवाय इसके कि Markdown पता-हार्वेस्टिंग स्पैमबॉट्स से आपके पते को अस्पष्ट करने में मदद करने के लिए कुछ यादृच्छिक दशमलव और हेक्स एंटिटी-एनकोडिंग भी करेगा। उदाहरण के लिए, Markdown इसे बदल देगा:

    <address@example.com>

कुछ इस तरह:

    <a href="&#x6D;&#x61;i&#x6C;&#x74;&#x6F;:&#x61;&#x64;&#x64;&#x72;&#x65;
    &#115;&#115;&#64;&#101;&#120;&#x61;&#109;&#x70;&#x6C;e&#x2E;&#99;&#111;
    &#109;">&#x61;&#x64;&#x64;&#x72;&#x65;&#115;&#115;&#64;&#101;&#120;&#x61;
    &#109;&#x70;&#x6C;e&#x2E;&#99;&#111;&#109;</a>

जो ब्राउज़र में "address@example.com" के लिए एक क्लिक करने योग्य लिंक के रूप में रेंडर होगा।

(इस प्रकार की एंटिटी-एनकोडिंग चाल वास्तव में कई, यदि अधिकांश नहीं, तो पता-हार्वेस्टिंग बॉट्स को बेवकूफ बनाएगी, लेकिन यह निश्चित रूप से सभी को बेवकूफ नहीं बनाएगी। कुछ नहीं से बेहतर है, लेकिन इस तरह प्रकाशित पता अंततः स्पैम प्राप्त करना शुरू हो जाएगा।)

<h3 id="backslash">बैकस्लैश एस्केप्स</h3>

Markdown आपको शाब्दिक वर्णों को उत्पन्न करने के लिए बैकस्लैश एस्केप का उपयोग करने की अनुमति देता है जिनका अन्यथा Markdown के फ़ॉर्मेटिंग सिंटैक्स में विशेष अर्थ होगा। उदाहरण के लिए, यदि आप एक शब्द को शाब्दिक तारांकन से घेरना चाहते हैं (HTML \`<em>\` टैग के बजाय), तो आप तारांकन से पहले बैकस्लैश का उपयोग कर सकते हैं, इस तरह:

    \\*शाब्दिक तारांकन\\*

Markdown निम्नलिखित वर्णों के लिए बैकस्लैश एस्केप प्रदान करता है:

    \\   backslash
    \`   backtick
    *   asterisk
    _   underscore
    {}  curly braces
    []  square brackets
    ()  parentheses
    #   hash mark
    +	plus sign
    -	minus sign (hyphen)
    .   dot
    !   exclamation mark
`;export{n as default};
